Revit 2026 API

# ParameterAsInteger Method

---

Provides access to the integer number within the parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int AsInteger()
```
```vb
Public Function AsInteger As Integer
```
```cpp
public:
int AsInteger()
```
```fsharp
member AsInteger : unit -> int
```

#### Return Value

Int32The integer value contained in the parameter.

The AsInteger method should only be used if the StorageType property returns that the internal contents of the parameter is an integer.

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace